icoFoamSolver/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "200";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
13248
(
(-0.0136408 0.0106805 4.44224e-20)
(-0.0253126 0.0143181 0)
(-0.0280702 0.00824953 -7.79615e-20)
(-0.0190259 -0.00098647 7.2191e-20)
(0.00528011 -0.0108997 6.72198e-20)
(0.0479645 -0.0206781 0)
(0.111246 -0.0297007 0)
(0.19575 -0.0372479 1.5602e-19)
...
)
;

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            symmetryPlane;
    }
    lowerWall
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    cylinder
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
